//========================================================================================================
//
//タイマーの処理[timer.cpp]
// Author Murata Shinnosuke
//
//========================================================================================================
#include "timer.h"
#include "number.h"
#include "manager.h"

//静的メンバ変数を初期化する
const int Timer::START_TIMER = 120;

//========================================================================================================
//初期化処理
//========================================================================================================
void Timer::Init()
{
}

//========================================================================================================
//更新処理
//========================================================================================================
void Timer::Update()
{
	//経過時間を確認する
	if (timeGetTime() / 1000 - m_dwTime >= 1)
	{//1秒経過した場合
		//時間を更新する
		m_dwTime = timeGetTime() / 1000;

		//タイマーを確認する
		if (m_nTimer > 0)
		{//0より大きい場合
			//タイマーを進める
			m_nTimer--;
		}

		//設定する
		this->GetObj()->GetComponent<Number>()->SetNumber(this->m_nTimer);
	}

	//タイマーを確認する
	if (this->m_nTimer <= 0)
	{
		//シーンを取得する
		Manager::Get()->GetScene()->NextScene();
	}
}