//========================================================================================================
//
//タイトルシーン[scene_mode_title.h]
// Author MurataShinnosuke
//
//========================================================================================================
#include "scene_mode.h"
#include "prefab.h"
#include "menu.h"

//========================================================================================================
//初期化処理
//========================================================================================================
void SceneModeTitle::Init()
{
	//背景を生成する
	Background2DPrefab::Create(Manager::Get()->GetTexture()->Get("title_00.png"));

	//タイトルメニューを生成する
	this->pTitleMenu = TitleMenuPrefab::Create();

	//フェードを生成する
	FadePrefab::Create();
}

//========================================================================================================
//終了処理
//========================================================================================================
void SceneModeTitle::Uninit()
{
	//オブジェクトを一括破棄する
	Object::DestroyAll();
}

//========================================================================================================
//更新処理
//========================================================================================================
void SceneModeTitle::Update()
{
	//オブジェクトを一括更新する
	Object::UpdateAll();

	//決定フラグを確認する
	Menu* pMenu = this->pTitleMenu->GetComponent<Menu>();
	if (pMenu->GetDecide() == true)
	{//決定フラグが立っている場合
		//選択を確認する
		int nSelect = pMenu->GetSelect();
		if (nSelect == TitleMenu::MENU::IS_START)
		{//スタートの場合
			//画面遷移フラグを立てる
			this->GetScene()->Next(Scene::MODE::IS_GAME);
		}
		else if (nSelect == TitleMenu::MENU::IS_RANKING)
		{//ランキングの場合
			//画面遷移フラグを立てる
			this->GetScene()->Next(Scene::MODE::IS_RANKIGN);
		}
	}
}

//========================================================================================================
//描画処理
//========================================================================================================
void SceneModeTitle::Draw()
{
	//オブジェクトを一括描画する
	Object::DrawAll();
}