//========================================================================================================
//
//体の処理[body.cpp]
// Author Murata Shinnosuke
//
//========================================================================================================
#include "body.h"
#include "transform.h"
#include "player.h"

//========================================================================================================
//初期化処理
//========================================================================================================
void Body::Init()
{
}

//========================================================================================================
//更新処理
//========================================================================================================
void Body::Update()
{
	////拡大率を小さくする
	//D3DXVECTOR3 scale = this->GetObj()->GetComponent<Transform>()->GetScale();
	//scale -= {0.005f, 0.005f, 0.0f};
	//if (scale.x <= 0.0f)
	//{//0になった場合
	//	//死亡フラグを立てる
	//	this->GetObj()->Death();

	//	//処理を終了する
	//	return;
	//}

	////サイズを変更する
	//this->GetObj()->GetComponent<Transform>()->SetScale(scale);

	//寿命を縮める
	this->m_nLife--;
	if (this->m_nLife <= 0)
	{
		//死亡フラグを立てる
		this->GetObj()->Death();

		//処理を終了する
		return;
	}
}

//========================================================================================================
//衝突処理
//========================================================================================================
void Body::Collision(Object* pObject, Physics::CONTACT contact)
{
	//衝突オブジェクトのタグを確認する
	if (pObject->GetTag() == Object::TAG::IS_PLAYER)
	{
		//衝突したオブジェクトを確認する
		if (pObject != this->m_pPlayer)
		{
			//ヒット処理を行う
			pObject->GetComponent<Player>()->Hit();
		}
	}
}