//========================================================================================================
//
//タイトルシーン処理[title.cpp]
// Author Murata Shinnosuke
//
//========================================================================================================
#include "title.h"
#include "manager.h"
#include "prefab.h"
#include "title_menu.h"

//========================================================================================================
//コンストラクタ
//========================================================================================================
Title::Title()
{
	//メンバ変数を初期化する
	this->m_pMenu = nullptr;
}

//========================================================================================================
//デストラクタ
//========================================================================================================
Title::~Title()
{
}

//========================================================================================================
//初期化処理
//========================================================================================================
void Title::Init()
{
	//背景を生成する
	Background2DPrefab::Create(Manager::Get()->GetTexture()->Get("title_00.png"));

	//タイトルメニューを生成する
	this->m_pMenu = TitleMenuPrefab::Create()->GetComponent<Menu>();

	//フェードを生成する
	FadePrefab::Create();
}

//========================================================================================================
//終了処理
//========================================================================================================
void Title::Uninit()
{
	//オブジェクトを一括破棄する
	Object::ReleaseAll();
}

//========================================================================================================
//更新処理
//========================================================================================================
void Title::Update()
{
	//オブジェクトを一括更新する
	Object::UpdateAll();

	//決定フラグを確認する
	if (this->m_pMenu->GetDecide() == true)
	{//決定フラグが立っている場合
		//選択中のメニューによって処理を変える
		switch (this->m_pMenu->GetSelect())
		{
		case TitleMenu::MENU::IS_START:   //スタートの場合
			//ゲーム画面に遷移する
			Manager::Get()->SetSceneMode(Scene::MODE::IS_GAME);

			//処理を抜け出す
			break;

		case TitleMenu::MENU::IS_RANKING:   //ランキングの場合
			//ランキング画面に遷移する
			Manager::Get()->SetSceneMode(Scene::MODE::IS_RANKIGN);

			//処理を抜け出す
			break;
		}

		//処理終了
		return;
	}
}

//========================================================================================================
//描画処理
//========================================================================================================
void Title::Draw()
{
	//オブジェクトを一括描画する
	Object::DrawAll();
}