//========================================================================================================
//
//シーン処理[scene.cpp]
// Author Murata Shinnosuke
//
//========================================================================================================
#include "scene.h"

//========================================================================================================
//モードをの変更処理
//========================================================================================================
void Scene::ChangeMode(SceneMode* pMode)
{
	//シーンをリセットする
	this->Reset();

	//現在のモードを確認する
	if (this->m_pMode == nullptr)
	{//モードが設定されていない場合
		//モードを設定する
		this->m_pMode = pMode;
	}
	else
	{//モードが設定されている場合
		//モードを上書きする
		this->m_pMode->Uninit();
		delete this->m_pMode;
		this->m_pMode = pMode;
	}

	//初期化する
	this->m_pMode->Init();
}